{
    "SUBMIT": "Submit",
    "SEND_REQUEST": "Send a new request",
    "REQUEST_PLACEHOLDER": "Type your request",
    "R_PLACEHOLDER": "Type obstacle coefficient",

    "ANIMATION_TITLE": "Shock Absorber animation",
    "R_PLACEHOLDER_2": "Obstacle height [m]",
    "CALCULATE_BUTTON": "Calculate",
    "OCTAVE_CLI_TITLE": "Octave CLI",
    "OCTAVE_RESULTS_PLACEHOLDER": "Result",
    "OCTAVE_CLI_COMMANDS": "Commands",
    "ACTIVE_USERS_TITLE": "Active users",
    "ACTIVE_USERS_SUBTITLE": "Join them.",
    "ACTIVE_USERS_INPUT": "Your name",
    "ACTIVE_USERS_SUBMIT": "Join",
    "ABOUT_PAGE": "About page",
    "API_DOC": "API Description",
    "API_DOC_0": "When the endpoint is requested, parameter 'r' is sent, which represents the height of the obstacle. Using Octave, the wheel and body values are calculated, which we use in the animation and write into to the graph as well.",
    "API_DOC_1": "This endpoint is used for the Octave CLI to work. The command that the user entered in the command line is sent in the request body and the response received is the result from Octave.",
    "API_DOC_2": "When the user requests values from Octave, whether for animation (car) or from Octave CLI (basic), this command is recorded and stored in the database, using this endpoint.",
    "API_DOC_3": "Returns all records from the log database.",
    "API_DOC_4": "Based on the 'username' parameter, all records associated with the user are found from the log database and returned.",
    "API_DOC_5": "All logs from the database are exported to a file.",
    "API_DOC_6": "All logs from the database are sent to the mail from the configuration file.",
    "API_DOC_7": "when command is invalid",
    "API_DOC_8": "when username is not existing",
    "API_DOC_RETURNS": "Returns",
    "EXPORT_LOGS": "Export Logs",
    "CLOSE": "Close",
    "INVALID_RUB_ALERT": "Enter a height between -0.3 a 0.3",
    "ABOUT_PAGE_CONTENT_0": "Our site has a form of a dashboard, where each section has a purpose.",
    "ABOUT_PAGE_CONTENT_1_TITLE": "Shock Absorber animation.",
    "ABOUT_PAGE_CONTENT_1": "The first and largest section is 'Shock Absorber Animation'. It consists of a graph, the animation of the vehicle with its slider, text input and a button. The user starts the simulation by entering a number between -0.3 and 0.3 in the text input. This number represents the height of the obstacle our vehicle will pass. Negative height value represents a pit. If the user enters a value outside the mentioned interval, he will be notified. If he enters the correct height, the animation starts and the text input with the button is replaced by a text informing that the simulation is in progress. The user must wait for the ongoing simulation to complete before entering another value. The graph above the animation is synchronized with the animation and records the current wheel and body positions. The slider below the animation is also connected to the vehicle wheel and the values created by the slider's movement are also reflected in the graph.",
    "ABOUT_PAGE_CONTENT_2_TITLE": "Octave CLI.",
    "ABOUT_PAGE_CONTENT_2": "The next section, located at the top right, is the Octave command line. This section works very simply. The user enters required command into the text input and presses the button just below it. It then shows the result in the gray field above the text input.",
    "ABOUT_PAGE_CONTENT_3_TITLE": "Active users.",
    "ABOUT_PAGE_CONTENT_3": "This section contains a list of active users on our site and text input to join them. The list of users will appear after clicking on Users button. Clicking on username will execute his last request. The user becomes member of the list after entering his username. The list itself consists of buttons with usernames.",
    "ABOUT_PAGE_CONTENT_4_TITLE": "Footer.",
    "ABOUT_PAGE_CONTENT_4": "Only the Footer remains under the main three sections. On its left side there is an information about the authors. The right half of Footer starts with the flags of the USA and Slovakia, which are used to switch between the languages. The 'About page' button follows, which displays a description of our site and instructions for using it in a modal window. This entire description can also be saved as PDF using the button in the modal window. The next button in Footer is 'API Description', which also displays a modal window, but this time with a description of our API. It contains a list of end-points, the form of input and output data, etc. End of the Footer is populated by the 'Export logs' button, thanks to which it is possible to download a record of commands sent to our API. Records can be downloaded as a CSV file.",
    "SIM_RUNNING": "Simulation is running!",
    "SIM_RUNNING_SECONDARY": "Wait, please.",
    "SAVE_PDF": "Save as PDF",
    "LOGS_EMAIL": "Send logs to email",
    "ACTIVE_USERS_BUTTON": "Users"
}
