{
    "SUBMIT": "Potvrdiť",
    "SEND_REQUEST": "Pošli novú požiadavku",
    "REQUEST_PLACEHOLDER": "Napíš tvoju požiadavku",
    "R_PLACEHOLDER": "Zadaj koeficient prekážky",

    "ANIMATION_TITLE": "Animácia tlmičov vozidla",
    "R_PLACEHOLDER_2": "Výška prekážky [m]",
    "CALCULATE_BUTTON": "Vypočítať",
    "OCTAVE_CLI_TITLE": "Octave CLI",
    "OCTAVE_RESULTS_PLACEHOLDER": "Výsledok",
    "OCTAVE_CLI_COMMANDS": "Príkazy",
    "ACTIVE_USERS_TITLE": "Aktívni používatelia",
    "ACTIVE_USERS_SUBTITLE": "Pridaj sa k nim",
    "ACTIVE_USERS_INPUT": "Tvoje meno",
    "ACTIVE_USERS_SUBMIT": "Pripojiť sa",
    "ABOUT_PAGE": "O stránke",
    "API_DOC": "Popis API",
    "API_DOC_0": "Pri requeste sa na endpoint pošle parameter 'r', ktorý predstavuje výšku prekážky. Pomocou Octave sa vypočítajú hodnoty kolesa aj karosérie, ktoré využijeme v animácii a zapíšu sa aj do grafu.",
    "API_DOC_1": "Tento endpoint sa využíva na fungovanie Octave CLI. V requeste sa posiela príkaz, ktorý používateľ zadal do príkazového riadku a v odpovedi príde výsledok z Octave.",
    "API_DOC_2": "Keď sa používateľ dožaduje na hodnoty z Octave, či už je to pre animáciu (car) alebo z Octave CLI (basic), tento príkaz sa zaznamenáva a ukladá do databázy, práve prostredníctvom tohto endpointu.",
    "API_DOC_3": "Vráti všetky záznamy z databázy logov.",
    "API_DOC_4": "Z databázy logov sa na základe parametra 'username' nájdu všetky záznamy viazané na používateľa s týmto username-om a vrátia sa.",
    "API_DOC_5": "Všetky logy z databázy sa exportujú do CSV súboru.",
    "API_DOC_6": "Všetky logy z databázy sa pošlú na mail z konfiguračného súboru.",
    "API_DOC_7": "keď je zadaný príkaz zlý",
    "API_DOC_8": "keď username neexistuje",
    "API_DOC_RETURNS": "Vracia",
    "EXPORT_LOGS": "Exportovať Logy",
    "CLOSE": "Zavrieť",
    "INVALID_RUB_ALERT": "Zadajte výšku medzi -0.3 a 0.3",
    "ABOUT_PAGE_CONTENT_0": "Naša stránka má podobu dashboardu, v ktorom má každá sekcia svoj jedinečný účel.",
    "ABOUT_PAGE_CONTENT_1_TITLE": "Animácia tlmičov vozidla.",
    "ABOUT_PAGE_CONTENT_1": "Prvou a najväčšou sekciou je 'Animácia tlmičov vozidla'. Skladá sa z grafu, samotnej animácie vozidla so sliderom, textového vstupu a tlačilda. Používateľ spustí simuláciu tak, že do textového vstupu zadá číslo v rozpätí -0.3 a 0.3. Toto číslo predstavuje výšku prekážky, po ktorej naše vozidlo prejde. V prípade zápornej výšky ide o jamu. Ak používateľ zadá hodnotu mimo spomenutého intervalu, bude na to upozornený. Ak zadá správnu výšku, animácia sa spustí a textový vstup s tlačidlom sú nahradené informačným textom, že prebieha simulácia. Pred zadaním ďalšej hodnoty tak musí používateľ počkať, kým prebiehajúca simulácia skončí. Graf, nachádzajúci sa nad animáciou, je s animáciou synchronizovaný a zapisujú sa doň aktuálne pozície kolesa a karosérie. Slider, ktorý sa nachádza pod animáciou je tiež spojený s kolesom vozidla a hodnoty vytvorené pohybom slidera sa taktiež odrazia na grafe.",
    "ABOUT_PAGE_CONTENT_2_TITLE": "Octave CLI.",
    "ABOUT_PAGE_CONTENT_2": "Ďalšou sekciou, nachádzajúcou sa vpravo hore, je príkazový riadok Octave. Táto sekcia funguje veľmi jednoducho. Používateľ napíše žiadaný príkaz do textového vstupu a stlačí tlačidlo hneď pod ním. Následne dostane výsledok v šedom poli nad textovým vstupom.",
    "ABOUT_PAGE_CONTENT_3_TITLE": "Aktívni používatelia.",
    "ABOUT_PAGE_CONTENT_3": "Táto sekcia obsahuje zoznam aktívnych používateľov na našej stránke a textový vstup, ktorý slúži na pridanie sa k nim. Zoznám používateľov sa zobrazí po stlačení tlačidla Používatelia. Kliknutím na meno používateľa sa vykoná posledný úkon tohto používateľa. Ak používateľ zadá svoj unikátny username, stane sa súčasťou zoznamu. Samotný zoznam pozostáva z tlačidiel s menami používateľov.",
    "ABOUT_PAGE_CONTENT_4_TITLE": "Footer.",
    "ABOUT_PAGE_CONTENT_4": "Pod hlavnými tromi sekciami nám už ostáva len Footer. Na jeho ľavej strane sa nachádza informácia o autoroch. Pravá polovica Footeru začína vlajkami USA a Slovenska, ktoré slúžia na prepínanie jazyka na stránke. Nasleduje tlačidlo 'O stránke', ktoré v modálnom okne zobrazí popis našej stránky a návod na jej použitie. Celý tento popis sa tiež dá uložiť ako PDF pomocou tlačidla v modálnom okne. Ďalšie tlačidlo vo Footeri je 'Popis API', ktoré taktiež zobrazí modálne okno, tentokrát však s popisom našej API. Obsahuje zoznam end-pointov, podobu vstupných aj výstupných dát, atď. Footer je ukončený tlačidlom 'Exportovať logy', vďaka ktorému je možné stiahnuť si záznam príkazov posielaných do našej API. Záznamy sa dajú stiahnuť v podobe CSV súboru.",

    "SIM_RUNNING": "Simulácia beží!",
    "SIM_RUNNING_SECONDARY": "Počkajte prosím.",
    "SAVE_PDF": "Uložiť ako PDF",
    "LOGS_EMAIL": "Odošli logy na email",
    "ACTIVE_USERS_BUTTON": "Používatelia"
}
